// generic або узагальнений тип - спеціальний тип даних, що дозволяє створювати компоненти не прив'язуючись
// до конкретного типу даних, а вказувати цей тип даних під час створення компонента.

// На рядку 9 створена функція-generic ця функція приймає один параметр типу T та повертає значення типу Т.
// T - type variable, спеціальний тип змінних, який використовується в узагальнених типах для того, щоб зберігати тип замість значення.

// Type variable буде зберігати тип даних, який надасть користувач функції під час її виклику.

function myFunc<T>(value: T): T {
    return value;
}

// функція myFunc приймає та повертає рядок. Тип даних вказано явно у кутових дужках
const value1 = myFunc<string>('test');

// функція приймає та повертає число. У цьому випадку використовується type argument inference
// компілятор самостійно визначать який тип потрібно використовувати
const value2 = myFunc<number>(10);

// generic має значну перевагу над any в плані типізації
function myFunc2(value: any): any {
    return value;
}

const value3 = myFunc2('test');
const value4 = myFunc2(10);
