export default {
    data() {
        return {count: 0}
    },
    methods: {
        increment() {
            this.count++
        },
        decrement() {
            this.count--
        },
        set(val) {
            this.count = val
        },
        reset() {
            this.count = 0
        }
    }
}

/*
Міксини не можуть приймати параметри, тому ми не можемо використовувати динамічну логіку.
Це робить їх менш гнучкими та придатними для багаторазового використання.

Дані в міксинах не захищені від мутацій. Компонент, може «тихо» змінити властивість міксину, що може призвести до багів, які важко виявити.

У міксинах ми не можемо точно відстежити дані компонента до його джерела. Це стосується як локально, так і глобально зареєстрованих міксинів.

При використанні декількох міксинів можуть виникати конфлікти імен.
 */